package 문법정리;

public class C02변수_Variable {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

	
	
	
/*
 
변수(variable)
중요한 프로그래밍 능력 중 하나는 data(값)를 잘 다루는 것

#1.1변수란?
	*단 하나의 값을 저장할 수 있는 메모리 공간
		1)수학에서는 '변하는 수'라고 정의
		2)프로그래밍언어에서는 값을 저장할 수 있는 메모리 상의 공간
		3)이 공간에 저장된 값은 변경 될 수 있기에 변수라 붙여짐

#1.2변수의 선언과 초기화
	1)변수이름
		*변수에 붙인 이름
		*변수는 값을 저장할 수 있는 메모리공간 이므로, 그 공간에 이름을 붙여주는 것
	2)변수선언
		*메모리의 빈 공간에 '변수타입'에 맞는 크기의 저장공간이 확보됨
		*이후 이 저장공간은 '변수이름'을 통해 사용

	3)변수의 초기화
		*사용전 반드시 변수를 초기화(initialization)해야 한다.
		*메모리는 여러 프로그램이 공유하는 자원이므로 
		*전에 다른 프로그램에 의해 저장된 '알 수 없는 값(쓰레기값, garbage value)이 남아 있을 수도 있기 때문
		*지역변수는 사용하기 전 초기화 필수, 클래스변수와 인스턴스 변수는 초기화 생략 가능
		* "변수의 초기화란?, "변수를 사용하기 전에 처음으로 값을 저장하는 것"
	
 */	
		
}


